[
  {
    "name": "R-301",
    "type": "Assault Rifles",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "R-301",
    "dmg": {
      "Body": 13,
      "Head": 23,
      "Leg": 10
    },
    "Base_magazine": 18,
    "White_magazine": 20,
    "Blue_magazine": 25,
    "Purple_magazine": 28,
    "description": "The latest in a proud line of standard - issue assault rifles, the R-301 Carbine is as reliable, versatile, and easy - to - control as its forebears, the R-101 and R201-SOAR. The series is almost as old as Frontier civilization — some say the first Carbines were built on Earth — and has been a mainstay in every Frontier conflict."
  },
  {
    "name": "Flatline",
    "type": "Assault Rifles",
    "ammoType": "heavy",
    "redWeapon": false,
    "inCraft": false,
    "img": "flatline",
    "dmg": {
      "Body": 18,
      "Head": 32,
      "Leg": 14
    },
    "Base_magazine": 20,
    "White_magazine": 25,
    "Blue_magazine": 28,
    "Purple_magazine": 30,
    "description": "The Flatline is a standard and beloved civilian firearm, used throughout the Frontier against predators of all species. Many Militia volunteers brought their personal Flatlines with them when they joined the ranks. Its harsh recoil makes it an inelegant piece of machinery, but its famous reliability and resilience ensure it will always have a place in Frontier life."
  },
  {
    "name": "Havoc",
    "type": "Assault Rifles",
    "ammoType": "energy",
    "redWeapon": false,
    "inCraft": false,
    "img": "havoc",
    "dmg": {
      "Body": 17,
      "Head": 30,
      "Leg": 13
    },
    "Base_magazine": 24,
    "White_magazine": 28,
    "Blue_magazine": 32,
    "Purple_magazine": 36,
    "description": "While the origin of the HAVOC is unknown, it's believed to be a custom build fashioned for a Devotion LMG fan with money to burn. A versatile energy rifle, the HAVOC is meant to mimic the behavior of the Devotion with the increased accuracy of an assault rifle and fewer attachments to reach maximum output. Some might call it “streamlined”, but a certain mystery buyer would probably choose “tailor - made” instead."
  },
  {
    "name": "Nemesis",
    "type": "Assault Rifles",
    "ammoType": "energy",
    "redWeapon": false,
    "inCraft": false,
    "img": "nemesis",
    "dmg": { "Body": 17, "Head": 30, "Leg": 13 },
    "Base_magazine": 20,
    "White_magazine": 24,
    "Blue_magazine": 28,
    "Purple_magazine": 32,
    "description": "The Nemesis was created by the weapons mod group known as The Sisters, who previously helped Rampart learn the tricks of the trade. However, when Rampart left their group and began growing more successful than them, they burned down Rampart's shop. Rampart suspected her prototype of the Nemesis was lost in the fire. Unbeknownst to her, The Sisters had stolen it. and decided to release it as their own."
  },
  {
    "name": "Hemlok",
    "type": "Assault Rifles",
    "ammoType": "heavy",
    "redWeapon": true,
    "inCraft": false,
    "img": "hemlok",
    "dmg": { "Body": 23, "Head": 41, "Leg": 17 },
    "Base_magazine": 30,
    "Ammo_Stockpile": 240,
    "description": "The Hemlok Burst AR is a heavy burst - fire assault rifle based on the Hemlok BF-R, a weapon developed exclusively for IMC ground troops. Lastimosa Armory was commissioned by the IMC to create a weapon with a stronger punch than the R-101, so it could more effectively puncture standard-issue body armor. During the Frontier War, direct sale to the public was prohibited but its updated model is commonplace in the Outlands."
  },
  {
    "name": "Alternator",
    "type": "Submachine gun",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "alternator",
    "dmg": { "Body": 16, "Head": 24, "Leg": 13 },
    "Base_magazine": 19,
    "White_magazine": 22,
    "Blue_magazine": 25,
    "Purple_magazine": 27,
    "description": "The Alternator is famous for its accuracy: featuring twin barrels that alternate fire from a single magazine, it suffers less of the barrel - wear that reduces accuracy in other firearms. However, its patented receiver and barrel assembly ensured that it could only be manufactured by Burrell Industries, hampering widespread adoption during the Frontier War. After Burrell's collapse following the Blackout, the design was reverse - engineered by surviving competitors, and current models have reached nearly the same level of sophistication."
  },
  {
    "name": "Prowler",
    "type": "Submachine gun",
    "ammoType": "heavy",
    "redWeapon": false,
    "inCraft": false,
    "img": "prowler",
    "dmg": { "Body": 15, "Head": 23, "Leg": 12 },
    "Base_magazine": 20,
    "White_magazine": 25,
    "Blue_magazine": 30,
    "Purple_magazine": 35,
    "description": "Designed for personal defense, the Prowler Burst PDW was an essential firearm for Pilots whose Titans were compromised during battle. Its compact shape gives it the punch of an assault rifle at a much smaller size, and its burst - action design allows the operator to lay down significant cover fire - this was particularly helpful for Pilots ejecting from their Titans. It can also be upgraded to a full - auto mode that allows the operator to put heavy fire down - range with the effective accuracy of an assault rifle."
  },
  {
    "name": "R-99",
    "type": "Submachine gun",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": true,
    "img": "r-99",
    "dmg": { "Body": 12, "Head": 18, "Leg": 10 },
    "Base_magazine": 19,
    "White_magazine": 21,
    "Blue_magazine": 24,
    "Purple_magazine": 27,
    "description": "The original R-97CN is intrinsically linked with orbital boarding: it was designed to provide heavy fire in confined, low - gravity spaces, essential for the Colonial Navy (the military arm of the Interstellar Colonial Authority) during boarding missions in high orbit. When former members of the Colonial Navy went freelance and ultimately joined the Mercenary Syndicate. the R-97CN was still so beloved that the organization commissioned a new model. Now the virtually indistinguishable R-99 is a common sight throughout the Outlands."
  },
  {
    "name": "Volt",
    "type": "Submachine gun",
    "ammoType": "energy",
    "redWeapon": false,
    "inCraft": false,
    "img": "volt",
    "dmg": { "Body": 15, "Head": 23, "Leg": 12 },
    "Base_magazine": 19,
    "White_magazine": 21,
    "Blue_magazine": 23,
    "Purple_magazine": 26,
    "description": "The first energy-based SMG to see regular use in the Frontier, the Volt allows its operator to fire a salvo of energy-based ammunition, decreasing drag and making it possible to hit multiple targets within a short window. In the early days of Frontier exploration, expeditions were often waylaid by dense populations of local wildlife. Progress ground to a halt as settlers were ill-equipped to protect themselves in unfamiliar terrain. The IMC commissioned the Volt, which could be used quickly and effectively at multiple distances, reducing casualties from local fauna and jumpstarting excursions into untouched territory."
  },
  {
    "name": "Car",
    "type": "Submachine gun",
    "ammoType": "heavy",
    "redWeapon": false,
    "inCraft": false,
    "img": "car",
    "dmg": { "Body": 13, "Head": 20, "Leg": 10 },
    "Base_magazine": 19,
    "White_magazine": 21,
    "Blue_magazine": 23,
    "Purple_magazine": 26,
    "description": "The C.A.R. SMG was developed by Lastimosa Armary to leverage the existing success of the company's R-101 platform. A smaller barrel, lighter alloys, and other weight reductions improve the weapon's handling, while smaller ammunition affords low recoil and a higher rate of fire. Traditionally, weapons with a high rate of fire tend to jam when used for extended durations-to remave this limitation, the R&D team at Lastimosa Armory created a “shoot by wire” system where the trigger is linked to the firing mechanism via an internal CPU. The system can detect overheat conditions, adjust rate of fire, and clear jams without operator intervention-often faster than the operator can realize a jam has occurred."
  },
  {
    "name": "Devotion",
    "type": "Light mashine gun",
    "ammoType": "energy",
    "redWeapon": false,
    "inCraft": false,
    "img": "devotion",
    "dmg": { "Body": 15, "Head": 23, "Leg": 13 },
    "Base_magazine": 36,
    "White_magazine": 40,
    "Blue_magazine": 44,
    "Purple_magazine": 48,
    "description": "The Devotion demands something different from its handler than most weapons: commitment. A cyclical, energy - assisted firing action increases its rate of fire the longer its trigger is held. This added 'spin - up' time can make the Devotion a risky choice in heated situations. However, upgrading it with a Turbocharger hop - up decreases its spin - up significantly and makes the fealty worthwhile."
  },
  {
    "name": "L-star",
    "type": "Light mashine gun",
    "ammoType": "energy",
    "redWeapon": true,
    "inCraft": false,
    "img": "l-star",
    "dmg": {
      "Body": 16,
      "Body_Armor": 25,
      "Head": 22,
      "Head_Armor": 35,
      "Leg": 14,
      "Leg_Armor": 22
    },
    "Base_magazine": 36,
    "Ammo_Stockpile": 324,
    "description": "The L-STAR is most accurately described as an automatic superheated plasma thrower. It fires large, combustible plasma projectiles, propelled from an internal superheating chamber. A special lens focuses the projectile, and uninterrupted fire can cause this lens to overheat and shatter. 'Feathering' the trigger is ideal, as it keeps the lens at a stable temperature while allowing continuous, personnel - suppressing bombardments."
  },
  {
    "name": "Spitfire",
    "type": "Light mashine gun",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "spitfire",
    "dmg": { "Body": 18, "Head": 27, "Leg": 15 },
    "Base_magazine": 35,
    "White_magazine": 40,
    "Blue_magazine": 45,
    "Purple_magazine": 50,
    "description": "The Spitfire has seen a great resurgence in the years since the Frontier War. Once an essential squad -support weapon, the advent of Titan warfare saw its role diminish, as it could neither pierce a Titan's armor or effectively track fast-moving Pilots. However, when regional conflicts escalated in the early years of the Outlands, the Spitfire was rediscovered and prized for providing consistently accurate, uninterrupted fire."
  },
  {
    "name": "Rampage",
    "type": "Light mashine gun",
    "ammoType": "heavy",
    "redWeapon": false,
    "inCraft": true,
    "img": "rampage",
    "dmg": { "Body": 26, "Head": 39, "Leg": 22 },
    "Base_magazine": 28,
    "White_magazine": 32,
    "Blue_magazine": 34,
    "Purple_magazine": 40,
    "description": "It's like Ramya 'Rampart' Parekh says: when you rise from the ashes of everything you've ever built, don't get mad—get heated. The Rampage LMG is the first gun she modded after a rival gang known as The Sisters burnt down her shop. Taking the M600 Spitfire as a base, it features a unique intake that can be loaded with a thermite canister to amp its fire rate. Inserting a thermite and overloading the firing mechanisms allows the user to deliver powerful shots (a distinct advantage over the base Spitfire) while increasing rate of fire for a set period of time. You could say it brings the heat."
  },
  {
    "name": "G7 Scout",
    "type": "Marksman weapon",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "g7_scout",
    "dmg": { "Body": 32, "Head": 56, "Leg": 24 },
    "Base_magazine": 10,
    "White_magazine": 15,
    "Blue_magazine": 18,
    "Purple_magazine": 20,
    "description": "The G7 Scout comes from good stock. The successor to the G2A4 Assault Rifle and the G2AS Battle Rifle, the G7 features a simple design and parts that are easy to reproduce, making it a crowd favorite in the Outlands most remote regions. The Scout adds a new. feature to the family with its updated sniper stock, improving long - range accuracy while not sacrificing mid - range effectiveness."
  },
  {
    "name": "Triple take",
    "type": "Marksman weapon",
    "ammoType": "energy",
    "redWeapon": false,
    "inCraft": false,
    "img": "triple_take",
    "dmg": { "Body": 63, "Head": 111, "Leg": 57 },
    "Base_magazine": 6,
    "White_magazine": 7,
    "Blue_magazine": 8,
    "Purple_magazine": 10,
    "description": "The Triple Take came close to dying at the blueprint stage. A successor to the Double Take that fires from three separate barrels with each shot, the base model's spread makes it less effective at long-range. The original Triple Take project was shelved, but a new version emerged in the Outlands after the Blackout. While many sniper rifles demand a high degree of precision from their operators, the Triple Take's spread proved more forgiving and effective for operators at all skill levels."
  },
  {
    "name": "30-30 Repeater",
    "type": "Marksman weapon",
    "ammoType": "heavy",
    "redWeapon": false,
    "inCraft": false,
    "img": "30-30_repeater",
    "dmg": {
      "Body": 42,
      "Body_Full_Charge": 57,
      "Head": 74,
      "Head_Full_ChargeHead": 100,
      "Head_skullpiercer": 88,
      "Head_skullpiercer_full_charge": 120,
      "Leg": 36,
      "Leg_Full_Charge": 48
    },
    "Base_magazine": 6,
    "White_magazine": 8,
    "Blue_magazine": 10,
    "Purple_magazine": 12,
    "description": "While some claim Fuse's mullet is the finest thing to come out of Salvo, most would agree it's the 30-30 Repeater. A lever action repeating rifle, it can be charged to increase the damage done by each shot. Only one bullet needs to be chambered in order for the weapon to fire, which makes the Repeater an asset in skirmishes where a single round can be the difference between victory and defeat. Originally designed to protect rural farms from beasts and poachers, and requiring minimal maintenance in the harsh sands of Salvo, the 30-30 has become a symbol of freedom to the Salvonian working class."
  },
  {
    "name": "Bocek",
    "type": "Marksman weapon",
    "ammoType": "Arrow",
    "redWeapon": true,
    "inCraft": false,
    "img": "bocek",
    "dmg": {
      "Body": 25,
      "Body_full_charge": 70,
      "Head": 31,
      "Head_full_charge": 123,
      "Leg": 20,
      "Leg_full_charge": 63,
      "Body_shatter": 6,
      "Body_shatter_full_charge": 12,
      "Head_shatter": 8,
      "Head_shatter_full_charge": 15,
      "Leg_shatter": 5,
      "Leg_shatter_full_charge": 12
    },
    "Ammo_Stockpile": 60,
    "description": "The first compound bows to reach the Frontier (all emblazoned with the brand name “Bocek” in shades of neon) were meant for sport and leisure activity. However, many parts of the Frontier proved to be inhospitable, and in lean months, these pieces of sports equipment were found to be a silent and inexpensive means of securing wild game. The latest models have been designed for durability, precision and power, and while the bow does not see regular use in combat where firearms are favored, it remains deadly in the hands of a skilled archer."
  },
  {
    "name": "Charge Rifle",
    "type": "Sniper Rifles",
    "ammoType": "sniper",
    "redWeapon": false,
    "inCraft": false,
    "img": "charge_rifle",
    "dmg": {
      "Body_beam": 3,
      "Body_pulse": 45,
      "Head_beam": 4,
      "Head_pulse": 56,
      "leg_beam": 3,
      "leg_pulse": 45
    },
    "Base_magazine": 3,
    "description": "This portable beam cannon was originally designed to take down Titans in the field, so imagine what it can do to a human. The Charge Rifle’s signature orange beam starts charging on trigger - pull and fires automatically when fully charged. This unique firing cadence makes accuracy essential - a poorly aimed shot will [eave the operator vulnerable to return fire. A shot that lands, however, can finish the fight before it starts."
  },
  {
    "name": "Longbow",
    "type": "Sniper Rifles",
    "ammoType": "sniper",
    "redWeapon": false,
    "inCraft": false,
    "img": "longbow",
    "dmg": {
      "Body": 55,
      "Head": 118,
      "Head_skullpiercer": 138,
      "Leg": 44
    },
    "Base_magazine": 6,
    "White_magazine": 8,
    "Blue_magazine": 12,
    "Purple_magazine": 12,
    "description": "The Longbow OMR marries the effective range of a sniper rifle and a semi - automatic rate of fire. An experienced marksman can use the Longbow to defend a wide swath of territory from a single perch, then seamlessly switch to firing from the hip if flanked. The rarity of suitable hop - ups make it difficult to modify, but nonetheless, it became a lynchpin in early civil struggles between Outlands townships before the signing of the Mercenary Syndicate accords."
  },
  {
    "name": "Kraber",
    "type": "Sniper Rifles",
    "ammoType": "sniper",
    "redWeapon": true,
    "inCraft": false,
    "img": "kraber",
    "dmg": {
      "Body": 140,
      "Head": 280,
      "Leg": 112
    },
    "Magazin": 4,
    "Ammo_Stockpile": 12,
    "description": "The original Kraber - AP sniper rifle was designed to take down slow - moving military vehicles. Its successor, the Kraber 50-cal, packs the same kind of power against much smaller targets. A single long - range shot can down a human target. A close - range shot, while significantly harder to land, will obliterate them."
  },
  {
    "name": "Sentinel",
    "type": "Sniper Rifles",
    "ammoType": "sniper",
    "redWeapon": false,
    "inCraft": false,
    "img": "sentinel",
    "dmg": {
      "Body": 70,
      "Body_charged": 88,
      "Head": 140,
      "Head_charged": 176,
      "Leg": 63,
      "Leg_charged": 79
    },
    "Base_magazine": 4,
    "White_magazine": 5,
    "Blue_magazine": 6,
    "Purple_magazine": 7,
    "description": "The Sentinel is a bolt action sniper rifle, effective at medium to long range and retrofitted to solve a unique problem. Snipers, for the Frontier Militia acted as linchpins in many of the Titan War's initial conflicts, but their effectiveness was undercut by the mass mobilization of Titans by the IMC. Militia snipers realized that if they could destroy a Titan's energy shield, that would create an opportunity for ground troops to do significant damage to the chassis. The result of these efforts—the Sentinel—was outfitted with a charge port that allowed projectiles to be energized and interfere with energy shields on impact. It would ultimately fall out of favor in Titan warfare (replaced by the heavy - hitting Charge Rifle). but remains a destructive force against a variety of targets at distance."
  },
  {
    "name": "RE-45",
    "type": "Pistols",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "re-45",
    "dmg": {
      "Body": 12,
      "Body_Hammerpoint": 16,
      "Head": 18,
      "Head_Hammerpoint": 24,
      "Leg": 11,
      "Leg_Hammerpoint": 14
    },
    "Base_magazine": 16,
    "White_magazine": 19,
    "Blue_magazine": 22,
    "Purple_magazine": 25,
    "description": "The original AP15 Auto pistol was manufactured by Lastimosa Armory and was favored by Pilots for its reliability, accuracy and high rate of fire. It was so renowned for its effectiveness that when the RE-45 Auto pistol (which is virtually identical to the AP15, excluding muzzle construction) was first released by Paradinha Arsenal, many believed it was a new model from Lastimosa. The RE-45 has now permeated the Outlands as demand increased for the famous 'Pilot' weapon."
  },
  {
    "name": "P2020",
    "type": "Pistols",
    "ammoType": "light",
    "redWeapon": false,
    "inCraft": false,
    "img": "p2020",
    "dmg": {
      "Body": 18,
      "Body_Hammerpoint": 27,
      "Head": 27,
      "Head_Hammerpoint": 41,
      "Leg": 16,
      "Leg_Hammerpoint": 24
    },
    "Base_magazine": 14,
    "White_magazine": 16,
    "Blue_magazine": 18,
    "Purple_magazine": 21,
    "description": "This small but reliable pistol was once standard - issue for IMC recruits before the Blackout. While lacking significant firepower, it's famously accurate with limited recoil, and modifications can significantly increase its rate of fire. A stand - off device in the muzzle also ensures greater accuracy in close quarters. When all other magazines are spent, it's comforting to have a P2020 on your hip."
  },
  {
    "name": "Wingman",
    "type": "Pistols",
    "ammoType": "sniper",
    "redWeapon": false,
    "inCraft": false,
    "img": "wingman",
    "dmg": {
      "Body": 45,
      "Head": 96,
      "Head_skullpiercer": 113,
      "Leg": 41
    },
    "Base_magazine": 6,
    "White_magazine": 7,
    "Blue_magazine": 8,
    "Purple_magazine": 9,
    "description": "The first energy-based SMG to see regular use in the Frontier, the Volt allows its operator to fire a salvo of energy-based ammunition, decreasing drag and making it possible to hit multiple targets within a short window. In the early days of Frontier exploration, expeditions were often waylaid by dense populations of local wildlife. Progress ground to a halt as settlers were ill-equipped to protect themselves in unfamiliar terrain. The IMC commissioned the Volt, which could be used quickly and effectively at multiple distances, reducing casualties from local fauna and jumpstarting excursions into untouched territory."
  },
  {
    "name": "EVA-8",
    "type": "Shotgun",
    "ammoType": "shotgun",
    "redWeapon": false,
    "inCraft": false,
    "img": "eva-8",
    "dmg": {
      "Body": 7,
      "Head": 9,
      "Leg": 7
    },
    "Base_magazine": 8,
    "description": "With the kick of a shotgun but a higher fire rate than the competition, the EVA-8 is an asset in close - quarters engagements against multiple or highly mobile targets. The EVA-8 was a mainstay during the Frontier War, where one was bound to make an appearance in almost all Pilot - to - Pilot engagements. However, the EVA-8 is also useful for civilians and ground troops, due to the forgiving nature of its firing pattern compared to other shotguns."
  },
  {
    "name": "Mastiff",
    "type": "Shotgun",
    "ammoType": "shotgun",
    "redWeapon": false,
    "inCraft": false,
    "img": "mastiff",
    "dmg": {
      "Body": 11,
      "Head": 14,
      "Leg": 11
    },
    "Base_magazine": 5,
    "description": "Originally designed as an anti - Pilot shotgun for ground troops, the Mastiff is a powerhouse against even the toughest adversaries. Each Mastiff shell separates into 'microslugs' when fired, spreading in a predictable and deadly horizontal pattern. Given the intricate nature of its design, the cost and time associated with creating a Mastiff makes it a rare but prized firearm."
  },
  {
    "name": "Mozambique",
    "type": "Shotgun",
    "ammoType": "shotgun",
    "redWeapon": false,
    "inCraft": false,
    "img": "mozambik",
    "dmg": {
      "Body": 15,
      "Body_Hammerpoint": 20,
      "Head": 29,
      "Head_Hammerpoint": 25,
      "Leg": 15,
      "Leg_Hammerpoint": 20
    },
    "Base_magazine": 6,
    "description": "In the wake of the mass Frontier Migration into the Outlands, regional conflicts and land - grabs created a demand for inexpensive firearms. The Mozambique shotgun (named for an execution technique with a similar, triangular spread) served that function for Pilots in the Frontier and a new model was soon being mass-produced for civilian use. The result is a firearm with a small magazine and minimal stopping power-while useful for self - defense, a standard Mozambique will require modifications (or a lot of luck) to be useful in a real fight."
  },
  {
    "name": "Peacekeeper",
    "type": "Shotgun",
    "ammoType": "shotgun",
    "redWeapon": false,
    "inCraft": false,
    "img": "peacekeeper",
    "dmg": {
      "Body": 9,
      "Head": 11,
      "Leg": 9
    },
    "Base_magazine": 5,
    "description": "As manufacturing became more commonplace with IMC expansion, the need to guard IMC factories and plants against outlaws increased. However, many ballistic firearms could not be used in these facilities due to the volatile materials involved in industrial production. The IMC turned to Lastimosa Armory for a solution, and the energy-based Peacekeeper was born. Slow and heavy-hitting, the Peacekeeper requires few charges to putdown a target at close range."
  }
]
